;; -*- no-byte-compile: t; -*-
;;; $DOOMDIR/packages.el


(package! all-the-icons-dired)

(package! evil-better-visual-line)

(package! org-download
  :recipe (:host github
            :repo "abo-abo/org-download"))

(package! org-protocol-capture-html
  :recipe (:host github
           :repo "alphapapa/org-protocol-capture-html"))

(package! org-noter)

(package! org-ref)

(package! helm-org-rifle)

(package! org-roam-bibtex)

(package! zotxt)

(package! package-lint)
(package! flycheck-package)

(package! bufler)
